import type { Entry, Provider } from './interface';

export default class FakeProvider implements Provider {
  name = 'FAKE';

  async *search(keyword: string): AsyncGenerator<Entry> {
    while (true) {
      await new Promise((res) => setTimeout(res, 200));
      yield {
        name: keyword,
        artist: keyword,
        $ref: 0,
      };
    }
  }

  async getLrc(): Promise<string> {
    return '[ti:你太诚实]\n[ar:she]\n[al:]\n[by:zxy869734784]\n[00:08.29]你太诚实\n[00:15.29]歌词编辑：朱学赢 QQ 756895783\n[00:35.29]谁拉住我 谁救救我\n[00:40.39]我从高空 狠狠地坠落\n[00:44.65]谁叫醒我 说这是梦\n[00:48.62]说你和她 什么都还没有\n[00:53.91]在窒息的沉默中 你\n[00:57.19] 握痛我的手\n[01:01.18]爱怎么了 我怎么了\n[01:05.00] 一句话都没有说\n[03:13.81][02:23.65][01:09.35]我曾经以为爱情应该诚实\n[03:17.66][02:27.90][01:13.42]但诚实却是最尖锐的刀子\n[03:22.17][02:32.19][01:17.66]你坦白一切留给我决定\n[03:25.48][02:35.76][01:20.99]是多么的自私\n[03:29.09][02:39.63][01:24.88]我恨你\n[03:30.27][02:40.65][01:26.03]就连你的感谢都太诚实\n[03:33.89][02:44.48][01:29.81]你不懂最大的温柔是掩饰\n[03:38.24][02:48.71][01:34.21]在我转身之前你看不到\n[03:41.60][02:51.76][01:37.42]我流泪的样子\n[03:48.84][02:56.43][01:41.12]\n[01:50.91]你没有错 我没有错\n[01:54.97]是一阵风 吹熄了承诺\n[01:59.14]你挣扎过 你要我懂\n[02:03.03]那谁来懂我心里的黑洞\n[02:08.42]我从来没有这么\n[02:11.47]渴望你欺骗我\n[02:15.70]掀开一切 千疮百孔\n[02:19.67]明天到底怎么过\n[10:00.00]LRC歌词下载：www.22lrc.com';
  }
}
